src/InformationRegisters/СобытияМетеор/СобытияМетеор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СобытияМетеор</name>
  <resources>
    <name>ИмяСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НомерЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕстьОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Данные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИсторияПримененияКонфигураций/ИсторияПримененияКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияПримененияКонфигураций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Коммит</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещениеОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Хранилище</name>
    <type>
      <types>CatalogRef.Хранилища</types>
    </type>
  </dimensions>
  <dimensions>
    <name>База1С</name>
    <type>
      <types>CatalogRef.Базы1С</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ХешиGitВерсийХранилища/ХешиGitВерсийХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХешиGitВерсийХранилища</name>
  <resources>
    <name>Хеш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВерсияХранилища</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КоммитыДополнений/КоммитыДополнений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КоммитыДополнений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Хеш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВерсияДополнения</name>
    <type>
      <types>CatalogRef.ВерсииДополнений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/РезультатыСинтаксическойПроверки/РезультатыСинтаксическойПроверки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыСинтаксическойПроверки</name>
  <resources>
    <name>КоличествоОшибокАПК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПровереноАПК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоОшибокBSL_LS</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПровереноBSLLS</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектПроверки</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
      <types>CatalogRef.ВерсииДополнений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИсторияЭтаповЗадачиМетеор/ИсторияЭтаповЗадачиМетеор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияЭтаповЗадачиМетеор</name>
  <resources>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ЭтапыЗадачиМетеор</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Тип</name>
    <type>
      <types>CatalogRef.ТипыЗадачиМетеор</types>
    </type>
  </resources>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>стрИсполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>ПользовательОС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Команды</types>
    </type>
  </attributes>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелеграмID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетеорИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_УИ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/СобытияМетеор/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СоздатьЗапись(ИмяСобытия, Текст) Экспорт
	
	Запись = РегистрыСведений.СобытияМетеор.СоздатьМенеджерЗаписи();
	Запись.День = НачалоДня(ТекущаяДатаСеанса());
	Запись.ИД = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Запись.ДатаЗаписи = МестноеВремя('00010101' + Запись.ИД / 1000);
	Запись.ДатаСобытия = Запись.ДатаЗаписи;
	Запись.ИмяСобытия = ИмяСобытия;
	Запись.Данные = Текст;
	
	КлючЕстьОшибки = "error";
	КлючЗадача = "task_id";
	Если ИмяСобытия = "HTTP" Тогда
		КлючЗадача = "task";
	КонецЕсли;
	
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Текст);
		СоответствиеJSON = ПрочитатьJSON(ЧтениеJSON, Истина, "date", ФорматДатыJSON.ISO);
		ЧтениеJSON.Закрыть();
		
		Если СоответствиеJSON.Получить("method") = "poststatus" Тогда
			Запись.ДатаСобытия = СоответствиеJSON.Получить("data").Получить("date");
		КонецЕсли;
		
		Запись.НомерЗадачи = НайтиЗначениеJSON(СоответствиеJSON, КлючЗадача);
		ЗначениеОшибка = НайтиЗначениеJSON(СоответствиеJSON, КлючЕстьОшибки, Ложь);
		Запись.ЕстьОшибки = (Не (ТипЗнч(ЗначениеОшибка) = Тип("Булево")) Или ЗначениеОшибка);
	Исключение
	КонецПопытки;
	
	Запись.Записать();
	
КонецПроцедуры

Процедура ОчиститьУстаревшиеДанные(ОставитьДней = 30) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СобытияМетеор.День КАК День
		|ИЗ
		|	РегистрСведений.СобытияМетеор КАК СобытияМетеор
		|ГДЕ
		|	СобытияМетеор.День < &ОтметкаВремени
		|
		|УПОРЯДОЧИТЬ ПО
		|	День";
	Запрос.УстановитьПараметр("ОтметкаВремени", ТекущаяДатаСеанса() - ОставитьДней * 86400);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Ластик = РегистрыСведений.СобытияМетеор.СоздатьНаборЗаписей();
		Ластик.Отбор.День.Установить(Выборка.День);
		Ластик.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Функция - Обработать действие
//
// Параметры:
//  Данные	 - Структура	 - 
// 
// Возвращаемое значение:
//   - Структура
//
Функция ОбработатьДействие(Данные) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеОтвета = Неопределено;
	
	Если Данные.method = "poststatus" Тогда
		ДанныеОтвета = poststatus(Данные.data);
	ИначеЕсли Данные.method = "ЗарегистрироватьОбновлениеИБ" Тогда
		Попытка
			ОтветСтрока = РегистрыСведений.ИсторияПримененияКонфигураций.ЗарегистрироватьОбновлениеИБ(Данные.Хранилище, Данные.НомерКоммита, Данные.База1С, Данные.Комментарий, Данные.Ответственный);
			ДанныеОтвета = Новый Структура("Ответ", ОтветСтрока);
		Исключение
			ДанныеОтвета = Новый Структура("Ошибка", ОписаниеОшибки());
		КонецПопытки;
		
		
	ИначеЕсли Данные.method = "ПолучитьХранилища" Тогда
		Попытка
			Массив = РегистрыСведений.ИсторияПримененияКонфигураций.ПолучитьХранилища();
			ОтветСтрока = XMLСтрока(Новый ХранилищеЗначения(Массив));
			ДанныеОтвета = Новый Структура("Ответ", ОтветСтрока);
		Исключение
			ДанныеОтвета = Новый Структура("Ошибка", ОписаниеОшибки());
		КонецПопытки;
		
	ИначеЕсли Данные.method = "ПолучитьБазы1С" Тогда
		Попытка
			Массив = РегистрыСведений.ИсторияПримененияКонфигураций.ПолучитьБазы1С(Данные.Хранилище);
			ОтветСтрока = XMLСтрока(Новый ХранилищеЗначения(Массив));
			ДанныеОтвета = Новый Структура("Ответ", ОтветСтрока);
		Исключение
			ДанныеОтвета = Новый Структура("Ошибка", ОписаниеОшибки());
		КонецПопытки;
		
	ИначеЕсли Данные.method = "ПолучитьПоследнийНомерКоммита" Тогда
		Попытка
			Число = РегистрыСведений.ИсторияПримененияКонфигураций.ПолучитьПоследнийНомерКоммита(Данные.Хранилище);
			ДанныеОтвета = Новый Структура("Ответ", Число);
		Исключение
			ДанныеОтвета = Новый Структура("Ошибка", ОписаниеОшибки());
		КонецПопытки;
		
	ИначеЕсли Данные.method = "ПолучитьРезультатЗапроса" Тогда
		Попытка
			ТЗ = ВнешниеДанные.ПолучитьРезультатЗапроса(Данные.ТекстЗапроса, Данные.СтруктураПараметров);
			ОтветСтрока = XMLСтрока(Новый ХранилищеЗначения(ТЗ));
			ДанныеОтвета = Новый Структура("Ответ", ОтветСтрока);
		Исключение
			ДанныеОтвета = Новый Структура("Ошибка", ОписаниеОшибки());
		КонецПопытки;
		
	ИначеЕсли Данные.method = "PostCheckStatusBSLLS" Тогда
		Попытка
			Если Не Данные.Свойство("GitHash")
				Или Не ЗначениеЗаполнено(Данные.GitHash)
				Или Не Данные.Свойство("NumberOfErrors") Тогда
				ВызватьИсключение "Expected json composition: {""GitHash"": ""hash_40_characters"", ""NumberOfErrors"": NumberOfErrors}";
			КонецЕсли;
			Запрос = Новый Запрос;
			Запрос.Текст = "";
			ВерсияХранилища = РегистрыСведений.ХешиGitВерсийХранилища.ВерсияХранилищаПоХэшу(Данные.GitHash);
			ВерсияДополнения = РегистрыСведений.КоммитыДополнений.ВерсияДополненияПоХэшу(Данные.GitHash);
			Если НЕ ВерсияХранилища.Пустая() Тогда
				ОбъектПроверки = ВерсияХранилища;
			ИначеЕсли Не ВерсияДополнения.Пустая() Тогда 
				ОбъектПроверки = ВерсияДополнения;
			Иначе
				ВызватьИсключение "no commit at the specified hash is detected";
			КонецЕсли;
			
			Менеджер = РегистрыСведений.РезультатыСинтаксическойПроверки.СоздатьМенеджерЗаписи();
			Менеджер.ОбъектПроверки = ОбъектПроверки;
			Менеджер.Прочитать();
			Менеджер.ОбъектПроверки = ОбъектПроверки;
			Менеджер.КоличествоОшибокBSL_LS = Данные.NumberOfErrors;
			Менеджер.ПровереноBSLLS = Истина;
			Менеджер.Записать();
			ОтветСтрока = "bls ls check result registered";
			ДанныеОтвета = Новый Структура("Ответ", ОтветСтрока);
			
		Исключение
			
			ДанныеОтвета = Новый Структура("Ошибка", ОписаниеОшибки());
			
		КонецПопытки;
		
	Иначе
		ВызватьИсключение СтрШаблон("Метод ""%1"" не поддерживается", Данные.method);
	КонецЕсли;
	
	Если ДанныеОтвета = Неопределено Тогда
		ДанныеОтвета = Новый Структура;
	КонецЕсли;
	
	Возврат ДанныеОтвета;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиЗначениеJSON(КоллекцияJSON, Ключ, ЗначениеПоУмолчанию = "") Экспорт
	
	Значение = ЗначениеПоУмолчанию;
	НайтиНомерЗадачиРекурсивно(КоллекцияJSON, Ключ, Значение);
	
	Возврат Значение;
	
КонецФункции

Процедура НайтиНомерЗадачиРекурсивно(КоллекцияJSON, Ключ, Значение)
	
	Для Каждого КлючИЗначение Из КоллекцияJSON Цикл
		Если КлючИЗначение.Ключ = Ключ Тогда
			Значение = КлючИЗначение.Значение;
			Возврат;
		КонецЕсли;
		Если ТипЗнч(КлючИЗначение.Значение) = Тип("Структура") Или ТипЗнч(КлючИЗначение.Значение) = Тип("Соответствие") Тогда
			НайтиНомерЗадачиРекурсивно(КлючИЗначение.Значение, Ключ, Значение);
			Если ЗначениеЗаполнено(Значение) Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция poststatus(data)
	
	ЗадачаМетеор = Справочники.ЗадачиМетеор.СоздатьЕслиОтсутствует(data.task);
	Этап = Справочники.ЭтапыЗадачиМетеор.ЭтапЗадачиМетеор(data.status);
	Исполнитель = Справочники.Пользователи.НайтиПоНаименованию(data.user, Истина);
	стрИсполнитель = data.user;
	Тип = Справочники.ТипыЗадачиМетеор.ТипЗадачиМетеор(data.type);
	comment = ?(data.Свойство("comment"), data.comment, "");
	
	ДатаСобытия = '00010101';
	Если data.Свойство("date") Тогда
		ДатаСобытия = СтроковыеФункцииКлиентСервер.СтрокаВДату(СтрЗаменить(data.date, "T", " "), ЧастиДаты.ДатаВремя);
	КонецЕсли;
	
	РегистрыСведений.ИсторияЭтаповЗадачиМетеор.Отразить(ЗадачаМетеор, Этап, Исполнитель, стрИсполнитель, Тип, comment, ДатаСобытия);
	
	Возврат Новый Структура;
	
КонецФункции

#КонецОбласти

#КонецЕсли
